In [224]:
import pandas as pd
import numpy as np
country = pd.read_csv("https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv", header=0)
#Show datasheet
country.head()

       Name     People     Area   BIP Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [195]:
#Display some basic information as rows, columns ...
country.shape

(5, 5)

In [196]:
#...and some basic statistical info.
country.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
Name        5 non-null object
People      5 non-null int64
Area        5 non-null int64
BIP         5 non-null int64
Currency    5 non-null object
dtypes: int64(3), object(2)
memory usage: 280.0+ bytes

In [197]:
#Show the last 4 Rows
country[-4:]

       Name     People     Area   BIP Currency
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [200]:
#Show all the row of countries who have the EURO
country[country.Currency == "EUR"]

      Name    People    Area   BIP Currency
0  Germany  82521653  357385  3466      EUR
3    Italy  60501718  301338  1850      EUR

In [201]:
#Show only name and Currency in a new data frame
newcountry=country[['Name','Currency']]
newcountry

       Name Currency
0   Germany      EUR
1     Japan      YEN
2    Canada      CAD
3     Italy      EUR
4  Brazilia     REAL

In [203]:
#Show only the rows/countries that have more than 2000 BIP (it is in Milliarden USD Bruttoinlandsprodukt)
country[country.BIP >= 2000]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN

In [217]:
#Select all countries where with inhabitants between 50 and 150 Mio
country[(country.People > 50000000) & (country.People < 150000000)]

      Name     People    Area   BIP Currency
0  Germany   82521653  357385  3466      EUR
1    Japan  126045000  377835  4938      YEN
3    Italy   60501718  301338  1850      EUR

In [218]:
#Change BIP to Bip
#country.columns = ['Name','People','Area','Bip','Currency']
country.rename(columns = {'BIP' : 'Bip'}, inplace = True)
country

       Name     People     Area   Bip Currency
0   Germany   82521653   357385  3466      EUR
1     Japan  126045000   377835  4938      YEN
2    Canada   36503097  9984670  1529      CAD
3     Italy   60501718   301338  1850      EUR
4  Brazilia  208360000  8515770  1798     REAL

In [219]:
#Calculate the Bip sum
country.Bip.sum()

13581

In [220]:
#Calculate the average people of all countries
country.People.mean()

102786293.6

In [221]:
#Sort by name alphabetically
country.sort_values('Name')

       Name     People     Area   Bip Currency
4  Brazilia  208360000  8515770  1798     REAL
2    Canada   36503097  9984670  1529      CAD
0   Germany   82521653   357385  3466      EUR
3     Italy   60501718   301338  1850      EUR
1     Japan  126045000   377835  4938      YEN

In [226]:
#Create a new data frame from the original where the area is changed as follows: all countries with > 1000000 get BIG and <= 1000000 get SMALL in the cell replaced!
country = pd.read_csv("https://raw.githubusercontent.com/edlich/eternalrepo/master/DS-WAHLFACH/countries.csv", header=0)

oldcountry = country
oldcountry['Area'] = np.where(country['Area'] > 1000000, 'Big', 'Small')
oldcountry

       Name     People   Area   BIP Currency
0   Germany   82521653  Small  3466      EUR
1     Japan  126045000  Small  4938      YEN
2    Canada   36503097    Big  1529      CAD
3     Italy   60501718  Small  1850      EUR
4  Brazilia  208360000    Big  1798     REAL

In [191]:
?country.where()